package com.company.chapter11objectcollections.tasks.task2829;

/**
 * 28. (2) Заполните контейнер P r i o r i t y Q u e u e (с использованием метода o f f e r ( ) )
 * значениями D o u b le , созданными генератором j a v a . u t i l . R a n d o m . Извлеките элементы из
 * очереди методом p o l l ( ) и выведите их.
 * <p>
 * 29. (2) Создайте простой класс, производный от O b j e c t и не содержащий членов.
 * Покажите, что множественные элементы этого класса не могут быть добавлены
 * в P r i o r i t y Q u e u e . Проблема будет более подробно рассмотрена в главе 17.
 */
public class Task {
}
