package com.company.chapter03operators.tasks.task01;

import java.util.Date;

/**
 * * 1. (1) Напишите программу, в которой используются как «короткие», так и «длинные» команды печати.
 */
class Task1 {
    public static void main(String[] args) {
        System.out.println("ривет, сегодня: ");
        System.out.println(new Date());

    }
}