package com.company.chapter17containerdetails.tasks.task09;

/**
 * 19. (1) Повторите упражнение 13 для SimpleHashMap.
 * 20. (3) Измените реализацию SimplpHashMap так, чтобы она сообщала о коллизиях.
 * Чтобы протестировать результат, добавьте один набор данных дважды, чтобы
 * спровоцировать коллизию.
 * 21. (2) Измените реализацию SimpleHashMap так, чтобы она сообщала количество необходимых «проб» при возникновении коллизий. Иначе говоря, сколько вызовов
 * пеЛ О долж но выполняться итераторами, обходящими списки LinkedList в поисках
 * совпадений?
 * 22. (4) Реализуйте методы clear() и remove() для SimpleHashMap.
 * 23. (3) Реализуйте остаток интерфейса Мар для SimpleHashMap.
 * 24. (5 ) По образцу SlmpleHashMap.java создайте и протестируйте SimpleHashSet.
 * 25. (6) Вместо того чтобы использовать L is tlte ra to r для каждой узловой группы, измените класс MapEntry так, чтобы он представлял собой автономный односвязный
 * список (каждый объект MapEntry должен содержать ссылку на следующий объект
 * MapEntry). Измените остальной код SknpleHashMap.java, чтобы новое решение работало
 * правильно.
 */
public class Task09 {
}
