package com.company.chapter19enumeratedtypes.tasks.task010;

/**
 * 10. (7) Измените класс VendingMachine (только) с использованием EnumMap, чтобы в одной
 * программе можно было создать несколько экземпляров VendingMachine.
 * 11. (7) В программном обеспечении настоящего торгового автомата нужно иметь возможность легко
 * добавлять и менять тип продаваемых товаров, так что ограничения,
 * устанавливаемые перечислением для lnput, не практичны (не забудьте, что перечисления предназначены
 * для ограниченных наборов типов). Измените код VendingMachine.java так, чтобы продаваемые товары представлялись классом, а не были
 * частью lnput, и инициализируйте контейнер ArrayList этих объектов из текстового
 * файла (используйте net.m indview.util.TextFile).
 * Проект1. Разработайте модель торгового автомата с поддержкой интернационализации,
 * чтобы один автомат мог быть легко приспособлен для всех стран
 */
public class Task010 {
}
