package com.company.chapter17containerdetails.tasks.task014;

/**
 * 40. (5) Создайте класс, содержащий два объекта String, и реализуйте для этого класса
 * интерфейс Comparable так, чтобы его метод проводил сравнение с учетом только первой строки.
 * Заполните массив и список ArrayList объектами этого класса, применив
 * генератор RandomGenerator. Покажите, что сортировка работает правильно. Теперь
 * создайте объект Comparator, который проводит сравнение с учетом только второй
 * строки, после чего покажите, что и в этом случае сравнение проходит верно;
 * выполните также двоичный поиск методом binarySearch() с использованием вашего
 * объекта Comparator.
 * <p>
 * 41. (3) Измените класс из предыдущего упражнения так, чтобы он работал с HashSet
 * и использовался в качестве ключа в HashMap.
 * <p>
 * 42. (2) Измените упражнение 40 так, чтобы в нем использовалась сортировка по алфавиту
 */
public class Task014 {
}
