package com.company.chapter17containerdetails.tasks.task011;

/**
 * 22. (2) Покажите, что вызов b i n a r y S e a r c h ( ) для несортированного массива приводит
 * к непредсказуемым результатам.
 * 23. (2) Создайте массив I n t e g e r , заполните его случайными значениями i n t
 * (с использованием автоматической упаковки) и отсортируйте в обратном порядке
 * с использованием C o m p a r a t o r .
 * 24. (3) Покажите, что в классе из упражнения 19 возможен поиск.
 */
public class task011 {
}
