package com.company.chapter21parallelexecution.tasks.task022;

/**
 * 22. (4) Реализуйте пример активного ожидания. Одна задача приостанавливается на
 * некоторое время, после чего устанавливает флаг. Вторая задача следит за флагом
 * в цикле while (активное ожидание), и когда флаг принимает значение true, сбрасывает
 * его в состояние false и выводит информацию об изменении на консоль. Обратите
 * внимание, сколько времени программа проводит в активном ожидании, и создайте
 * вторую версию программы, использующую wait() вместо активного ожидания.
 */
public class Task022 {
}
