package com.company.chapter21parallelexecution.tasks.task024;

/**
 * 24. (1) Решите задачу сотрудничества с одним производителем и одним потребителем,
 * используя методы wait() и notifyAll(). Производитель не должен переполнить
 * буфер потребителя-получателя, что может произойти в том случае, если первый
 * работает быстрее второго. Если же потребитель действует оперативнее, он не должен считывать
 * одни и те же данные по несколько раз. Не стройте никаких предположений в отношении относительной скорости их работы.
 */
public class Task024 {
}
